import { sidebar } from 'vuepress-theme-hope'
import kfbjVue from './kfbj/Vue'
import kfbjjs from './kfbj/js'
import qdkfes6 from './qdkj/es6'
import qdkfreact from './qdkj/react'
export default sidebar({
  /**
   * 小记
   */
  '/小记/': ['初来南京', '二二年八月总结', '二二年九月总结', '二二年总结'],
  /**
   * 开发笔记
   */
  '/开发笔记/CSS/': ['calc函数', 'CSS文本溢出处理方式'],
  '/开发笔记/JS/': kfbjjs,
  '/开发笔记/Vue/': kfbjVue,
  '/开发笔记/React/': [
    '开发流程管理平台学习心得',
    'Hook对比HOC和renderProps',
    'React中引入图片',
  ],
  /**
   *  算法
   */
  '/算法/': [
    '',
    '时间空间复杂度',
    '栈',
    '队列',
    '链表',
    '集合',
    '字典',
    '树',
    '图',
  ],
  /**
   * 前端基石
   */
  '/前端基石/CSS3/': [
    '基础与盒模型',
    '浮动与定位',
    '边框圆角与盒子阴影',
    '背景与渐变',
    '2D与3D转换',
    '过渡与动画',
  ],
  '/前端基石/JS基础/': [
    '变量与数据类型',
    '操作符',
    '流程控制语句',
    '数组',
    '函数',
    'DOM',
    'BOM',
    '面向对象',
    '正则表达式',
  ],
  /**
   * 前端图形
   */
  '/前端图形/canvas/': ['canvas基础'],
  '/前端图形/玩转CSS艺术之美/': ['浏览器', '回流重绘'],
  '/前端图形/Three.js/': [
    '开发环境搭建',
    'Three开发入门与调试设置',
    'Threejs物体',
    '材质与纹理',
  ],
  '/前端图形/CSS世界阅读笔记/': ['概述'],
  /**
   * 前端框架
   */
  '/前端框架/Vue/': [
    'Vue核心',
    'Vue组件化编程',
    'VueX',
    'VueRouter',
    'Vue3',
    'Pinia',
  ],
  '/前端框架/React/': qdkfreact,
  /**
   * 前端进阶
   */
  '/前端进阶/ES6/': qdkfes6,
  '/前端进阶/移动开发/': ['移动Web开发入门'],
  '/前端进阶/重学前端/': ['JavaScript'],
  '/前端进阶/JS进阶/': ['深入理解javascript原型和闭包'],
  '/前端进阶/TypeScript/': ['是否真的需要TS', 'TS基础', 'TS面向对象', 'TS进阶'],
  /**
   * 基础知识
   */
  '/基础知识/计算机网络/': ['概述篇'],
  '/基础知识/浏览器工作原理与实践/': ['思维导图', '01'],
  /**
   * 前端面试
   */
  '/前端面试/面试题总结/': [
    'html面试题',
    'CSS面试题',
    'JS面试题',
    'Vue面试题',
    '计网&浏览器面试题',
    '手撕代码',
  ],
  '/前端面试/面试复盘/': [
    '21.9.14一面复盘',
    '21.10.12技术面',
    '21.10.20技术面复盘',
    '21.10.21技术面复盘',
  ],
  /**
   * 食谱
   */
  '/食谱/': ['青椒火腿炒鸡蛋', '泡面的神仙吃法'],
})
